In [1]:
import pandas as pd

In [6]:
data = [(1, 2, 3 ,4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)
]
df = pd.DataFrame(data, index = 'l1 l2 l3 l4'.split(), columns= 'c1 c2 c3 c4'.split()) 
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [8]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [10]:
df[['c1', 'c3']]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

In [17]:
#Selecionando linhas e colunas ao mesmo tempo
df[1:3][['c1','c3']]

    c1  c3
l2   5   7
l3   8  11

In [18]:
#Selecionando linhas
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [24]:
#loc seleciona as linha loc['rotulo_linha']
#O loc[] so funciona com o nome do indice do df
df.loc[['l2', 'l3'], ['c4', 'c1'] ]

    c4  c1
l2   8   5
l3  12   8

In [21]:
#O loc consegue selecionar registros individuais com loc['rotulo_linha', 'rotulo_coluna']
df.loc['l2', 'c3']

7

In [22]:
#iloc seleciona por indices numericos iloc[indice_linha, indice_coluna]
df.iloc[0, 1]

2

In [23]:
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   8
l1   4   1